{
    "title": "JAVA Overview",
    "description": "<p><b>Java</b><span> is a </span><a href=\"https://en.wikipedia.org/wiki/High-level_programming_language\">high-level</a><span>, </span><a href=\"https://en.wikipedia.org/wiki/Class-based_programming\">class-based</a><span>, </span><a href=\"https://en.wikipedia.org/wiki/Object-oriented_programming\">object-oriented</a><span> </span><a href=\"https://en.wikipedia.org/wiki/Programming_language\">programming language</a><span> that is designed to have as few implementation </span><a href=\"https://en.wikipedia.org/wiki/Dependency_(computer_science)\">dependencies</a><span> as possible. It is a </span><a href=\"https://en.wikipedia.org/wiki/General-purpose_language\">general-purpose</a><span> programming language intended to let </span><a href=\"https://en.wikipedia.org/wiki/Computer_program\">computer programs</a><span> be written once and run anywhere, meaning that compiled Java code can run on all platforms that support Java without the need for recompilation. Java applications are typically compiled to bytecode that can run on any Java virtual machine (JVM) regardless of the underlying computer architecture. The syntax of Java is similar to C and C++, but it has fewer low-level facilities than either of them. As of 2019, Java was one of the most popular programming languages in use according to GitHub, particularly for client-server web applications, with a reported 9 million developers. Java was originally developed by James Gosling at Sun Microsystems (which has since been acquired by Oracle Corporation) and released in 1995 as a core component of Sun Microsystems' Java platform. The language derives much of its syntax from C and C++, but it has fewer low-level facilities than either of them. Java applications are typically compiled to bytecode that can run on any Java virtual machine (JVM) regardless of the underlying computer architecture. The syntax of Java is similar to C and C++, but it has fewer low-level facilities than either of them.</span></p>",
    "author": "Jarvis",
    "slug": "tut_1",
    "language": "java",
    "metadesc": "Introduction to JAVA",
    "index": 0
}